# Limpieza y Transformacion de datos

<!-- # Limpieza y Transformacion de Datos -->

In [6]:
# Importar librerias
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Importar archivos .CSV

In [7]:
salaries = pd.read_csv("./Datasets/linkedin-jobs-usa.csv")

# Tratamiento de Duplicados

In [8]:
salaries.drop_duplicates()

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
0,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,Buffalo-Niagara Falls Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
1,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"San Jose, CA","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
2,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Texas, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
3,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Illinois, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
4,Entry-Level Data Analyst,The Federal Savings Bank,"The Federal Savings Bank, a national bank and ...",onsite,NaN,"Chicago, IL","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-17,https://www.linkedin.com/jobs/view/entry-level...
...,...,...,...,...,...,...,...,...,...
2840,Junior Data Analyst,Iris Software Inc.,"Iris's client, one of the world's largest fina...",hybrid,NaN,"Texas, United States","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-21,https://www.linkedin.com/jobs/view/junior-data...
2841,Data Analyst (SQL),Marwood Group,The Marwood Group (Marwood) is a leading healt...,hybrid,"$75,000.00\r\n -\r\n $95...",New York City Metropolitan Area,"[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-26,https://www.linkedin.com/jobs/view/data-analys...
2842,Data Analyst,SmartSense by Digi,"Join a high-performing, tight-knit team at a f...",hybrid,NaN,"Mishawaka, IN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
2843,Data Analyst,Synergy Search,Nashville (Berry Hill) based company looking t...,hybrid,"$85,000.00\r\n -\r\n $95...",Nashville Metropolitan Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...
2844,Data Analyst,Insight Global,Overview - Minimum 5 years in a quantitative d...,hybrid,"$130,000.00\r\n -\r\n $1...","Burbank, CA","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...

In [17]:
salaries_limpieza = salaries.copy()

In [18]:
salaries_limpieza.duplicated

<bound method DataFrame.duplicated of                                title                   company  \
0     Data Analyst - Recent Graduate                    PayPal
1     Data Analyst - Recent Graduate                    PayPal
2                       Data Analyst                    PayPal
3                       Data Analyst                    PayPal
4           Entry-Level Data Analyst  The Federal Savings Bank
...                              ...                       ...
2840             Junior Data Analyst        Iris Software Inc.
2841              Data Analyst (SQL)             Marwood Group
2842                    Data Analyst        SmartSense by Digi
2843                    Data Analyst            Synergy Search
2844                    Data Analyst            Insight Global

                                            description onsite_remote  \
0     At PayPal (NASDAQ: PYPL), we believe that ever...        onsite
1     At PayPal (NASDAQ: PYPL), we believe that ever...        onsite
2     At PayPal (NASDAQ: PYPL), we believe that ever...        onsite
3     At PayPal (NASDAQ: PYPL), we believe that ever...        onsite
4     The Federal Savings Bank, a national bank and ...        onsite
...                                                 ...           ...
2840  Iris's client, one of the world's largest fina...        hybrid
2841  The Marwood Group (Marwood) is a leading healt...        hybrid
2842  Join a high-performing, tight-knit team at a f...        hybrid
2843  Nashville (Berry Hill) based company looking t...        hybrid
2844  Overview - Minimum 5 years in a quantitative d...        hybrid

                                                 salary  \
0                                                   NaN
1                                                   NaN
2                                                   NaN
3                                                   NaN
4                                                   NaN
...                                                 ...
2840                                                NaN
2841  $75,000.00\r\n            -\r\n            $95...
2842                                                NaN
2843  $85,000.00\r\n            -\r\n            $95...
2844  $130,000.00\r\n            -\r\n            $1...

                             location  \
0          Buffalo-Niagara Falls Area
1                        San Jose, CA
2                Texas, United States
3             Illinois, United States
4                         Chicago, IL
...                               ...
2840             Texas, United States
2841  New York City Metropolitan Area
2842                    Mishawaka, IN
2843      Nashville Metropolitan Area
2844                      Burbank, CA

                                               criteria posted_date  \
0     [{'Seniority level': 'Not Applicable'}, {'Empl...  2022-11-22
1     [{'Seniority level': 'Not Applicable'}, {'Empl...  2022-11-22
2     [{'Seniority level': 'Not Applicable'}, {'Empl...  2022-11-17
3     [{'Seniority level': 'Not Applicable'}, {'Empl...  2022-11-17
4     [{'Seniority level': 'Entry level'}, {'Employm...  2022-11-17
...                                                 ...         ...
2840  [{'Seniority level': 'Mid-Senior level'}, {'Em...  2022-10-21
2841  [{'Seniority level': 'Mid-Senior level'}, {'Em...  2022-10-26
2842  [{'Seniority level': 'Associate'}, {'Employmen...  2022-11-17
2843  [{'Seniority level': 'Not Applicable'}, {'Empl...  2022-11-14
2844  [{'Seniority level': 'Mid-Senior level'}, {'Em...  2022-11-14

                                                   link
0     https://www.linkedin.com/jobs/view/data-analys...
1     https://www.linkedin.com/jobs/view/data-analys...
2     https://www.linkedin.com/jobs/view/data-analys...
3     https://www.linkedin.com/jobs/view/data-analys...
4     https://www.linkedin.com/jobs/view/entry-level...
...                                                 ...
2840  https://www.linkedin.com/jobs/view/junior-data...
2841  https://www.linkedin.com/jobs/view/data-analys...
2842  https://www.linkedin.com/jobs/view/data-analys...
2843  https://www.linkedin.com/jobs/view/data-analys...
2844  https://www.linkedin.com/jobs/view/data-analys...

[2845 rows x 9 columns]>

In [19]:
salaries_limpieza.duplicated().sum()

np.int64(0)

In [20]:
salaries[salaries_limpieza.duplicated()]

Empty DataFrame
Columns: [title, company, description, onsite_remote, salary, location, criteria, posted_date, link]
Index: []

In [21]:
salaries_limpieza = salaries_limpieza.drop_duplicates

# Tratamientos de valores nulos nan

### Visualizar los valores nulos

In [ ]:
print(f'valores NaN por columna {salaries_limpieza.isna().sum()}')

AttributeError: 'function' object has no attribute 'isna'

In [24]:
salaries_limpieza.isna()

AttributeError: 'function' object has no attribute 'isna'

In [ ]:
df_sin_nulos = salaries.dropna()

df_sin_nulos_columnas

In [29]:
df_sin_nulos.head()

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
8,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...
24,Data Analyst,"Eva Garland Consulting, LLC","Reporting to the Director of Operations, the D...",onsite,"$50,000.00\r\n -\r\n $55...","Raleigh, NC","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
35,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...
61,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...
88,Data Analyst,London Approach,The ideal candidate for the Data Analyst/Finan...,onsite,"$100,000.00\r\n -\r\n $1...","Franklin, TN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-21,https://www.linkedin.com/jobs/view/data-analys...

In [30]:
df_sin_nulos['salary'].head()

8     $100,000.00\r\n            -\r\n            $1...
24    $50,000.00\r\n            -\r\n            $55...
35    $100,000.00\r\n            -\r\n            $1...
61    $100,000.00\r\n            -\r\n            $1...
88    $100,000.00\r\n            -\r\n            $1...
Name: salary, dtype: object

In [31]:
df_sin_nulos.shape

(929, 9)

### `axis (0) -> Revisa por fila`
### `axis (1) -> Revisa por columna`

### `Any` : Elimina si por linea hay un NaN
### `All` : Sin todos son NaN

In [ ]:
df_sin_nulos_columnas = (variable) salaries : DataFrame
df_sin_nulos_columnas = (variable) salaries : DataFrame

## TransformaciÃ³n de datos

In [32]:
df_sin_nulos['salary']

8       $100,000.00\r\n            -\r\n            $1...
24      $50,000.00\r\n            -\r\n            $55...
35      $100,000.00\r\n            -\r\n            $1...
61      $100,000.00\r\n            -\r\n            $1...
88      $100,000.00\r\n            -\r\n            $1...
                              ...
2834        $30.00\r\n            -\r\n            $33.00
2836    $120,000.00\r\n            -\r\n            $1...
2841    $75,000.00\r\n            -\r\n            $95...
2843    $85,000.00\r\n            -\r\n            $95...
2844    $130,000.00\r\n            -\r\n            $1...
Name: salary, Length: 929, dtype: object

In [34]:
## Este cÃ³digo toma una columna 'salary' que contiene valores de salario en formato de cadena, 
## elimina cualquier caracter no numÃ©rico, extrae los dÃ­gitos y convierte la columna resultante en valores numÃ©ricos de tipo float. 
##El resultado se almacena en una nueva columna llamada 'salary_numeric'. 
##Esto es Ãºtil cuando la columna 'salary' inicial contiene caracteres no numÃ©ricos y se desea trabajar con los salarios como valoresÂ numÃ©ricos.

df_sin_nulos['salary_numeric'] = df_sin_nulos['salary'].replace('[^\d.]', '', regex=True).str.extract('(\d+)').astype(float)

<>:6: SyntaxWarning: invalid escape sequence '\d'
<>:6: SyntaxWarning: invalid escape sequence '\d'
<>:6: SyntaxWarning: invalid escape sequence '\d'
<>:6: SyntaxWarning: invalid escape sequence '\d'
C:\Users\Mimi0\AppData\Local\Temp\ipykernel_24800\4043610048.py:6: SyntaxWarning: invalid escape sequence '\d'
  df_sin_nulos['salary_numeric'] = df_sin_nulos['salary'].replace('[^\d.]', '', regex=True).str.extract('(\d+)').astype(float)
C:\Users\Mimi0\AppData\Local\Temp\ipykernel_24800\4043610048.py:6: SyntaxWarning: invalid escape sequence '\d'
  df_sin_nulos['salary_numeric'] = df_sin_nulos['salary'].replace('[^\d.]', '', regex=True).str.extract('(\d+)').astype(float)
C:\Users\Mimi0\AppData\Local\Temp\ipykernel_24800\4043610048.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_sin_nulos['salary_numeric'] = df_sin_nulos['salary'].replace('[^\d.]', '', regex=True).str.extract('(\d+)').astype(float)

In [36]:
import re

# Extrae el primer nÃºmero vÃ¡lido (entero o decimal) de cada celda y lo convierte a float
df_sin_nulos['salary_numeric'] = df_sin_nulos['salary'].astype(str).apply(
    lambda x: float(re.search(r'\d+(?:\.\d+)?', x).group()) if re.search(r'\d+(?:\.\d+)?', x) else None
)

C:\Users\Mimi0\AppData\Local\Temp\ipykernel_24800\2095471033.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_sin_nulos['salary_numeric'] = df_sin_nulos['salary'].astype(str).apply(

In [37]:
df_sin_nulos['salary_numeric']

8       100.0
24       50.0
35      100.0
61      100.0
88      100.0
        ...
2834     30.0
2836    120.0
2841     75.0
2843     85.0
2844    130.0
Name: salary_numeric, Length: 929, dtype: float64